/*********************************************************************************************************************
* STC32G144K Opensourec Library 即（STC32G144K 开源库）是一个基于官方 SDK 接口的第三方开源库
* Copyright (c) 2025 SEEKFREE 逐飞科技
*
* 本文件是STC32G144K开源库的一部分
*
* STC32G144K 开源库 是免费软件
* 您可以根据自由软件基金会发布的 GPL（GNU General Public License，即 GNU通用公共许可证）的条款
* 即 GPL 的第3版（即 GPL3.0）或（您选择的）任何后来的版本，重新发布和/或修改它
*
* 本开源库的发布是希望它能发挥作用，但并未对其作任何的保证
* 甚至没有隐含的适销性或适合特定用途的保证
* 更多细节请参见 GPL
*
* 您应该在收到本开源库的同时收到一份 GPL 的副本
* 如果没有，请参阅<https://www.gnu.org/licenses/>
*
* 额外注明：
* 本开源库使用 GPL3.0 开源许可证协议 以上许可申明为译文版本
* 许可申明英文版在 libraries/doc 文件夹下的 GPL3_permission_statement.txt 文件中
* 许可证副本在 libraries 文件夹下 即该文件夹下的 LICENSE 文件
* 欢迎各位使用并传播本程序 但修改内容时必须保留逐飞科技的版权声明（即本声明）
*
* 文件名称          
* 公司名称          成都逐飞科技有限公司
* 版本信息          查看 libraries/doc 文件夹内 version 文件 版本说明
* 开发环境          MDK FOR C251
* 适用平台          STC32G144K
* 店铺链接          https://seekfree.taobao.com/
*
* 修改记录
* 日期              作者           备注
* 2025-11-20        大W            first version
********************************************************************************************************************/
#include "zf_common_headfile.h"



// *************************** 例程硬件连接说明 ***************************
// 使用 type-c 连接
//      直接将type-c插入核心板，即可使用USB-CDC
//

// *************************** 例程测试说明 ***************************
// 1.核心板烧录完成本例程，使用 type-c接口，在断电情况下完成连接
//
// 2.将 type-c的USB-CDC接口连接 电脑，完成上电
//
// 3.电脑上使用串口助手打开对应的串口，串口波特率为 zf_common_debug.h 文件中 DEBUG_UART_BAUDRATE 宏定义 默认 115200，核心板按下复位按键
//
// 4.可以在串口助手上看到如下串口信息：
//      Battery voltage detection demo.
//      Battery voltage is : xxxx. (0-4096)
//      Battery voltage is : xx.xxx. (0V-13.2V)
//
// 5.示数会根据电池电压变化
//
// 如果发现现象与说明严重不符 请参照本文件最下方 例程常见问题说明 进行排查

uint16 voltage_adc = 0;
float voltage_now = 0;

// **************************** 代码区域 ****************************
void main(void)
{
    clock_init(SYSTEM_CLOCK_96M); 				// 时钟配置及系统初始化<务必保留>
    debug_init();                       		// 调试串口信息初始化

    // 此处编写用户代码 例如外设初始化代码等
    adc_init(ADC1_CH0_P10, ADC_12BIT);                                          // 建议电磁传感器用 ADC1 电池检测用 ADC2
    printf("Battery voltage detection demo.\r\n");
    // 此处编写用户代码 例如外设初始化代码等

    while(1)
    {
        // 此处编写需要循环执行的代码
        voltage_adc = adc_convert(ADC1_CH0_P10);
        voltage_now = (float)11 * 3.3 * voltage_adc / 4095 ;                    // 根据逐飞科技学习主板分压计算 测得应该是电池电压 1/11 那么最大量程 36.3V
        printf("Battery voltage is : %d. (0-4096)\r\n", voltage_adc);           // 由于电阻会有误差 ADC检测本身也会有一些误差 所以这里对应数值可能跟实际电压有较多误差
        printf("Battery voltage is : %2.3fV. (0V-13.2V)\r\n", voltage_now);     // 这里换算的一定会跟实际电池电压有误差 需要按照实际的检测结果为准 可以自行矫正
        system_delay_ms(3000);
        // 此处编写需要循环执行的代码
    }
}
// **************************** 代码区域 ****************************

// *************************** 例程常见问题说明 ***************************
// 遇到问题时请按照以下问题检查列表检查
//
// 问题1：串口没有数据
//      查看串口助手打开的是否是正确的串口，检查打开的 COM 口是否对应的type-c的USB_CDC
//      如果是的type-c的USB_CDC连接，那么检查下载器线是否松动
//
// 问题2：串口数据乱码
//      查看串口助手设置的波特率是否与程序设置一致，程序中 zf_common_debug.h 文件中 DEBUG_UART_BAUDRATE 宏定义为 debug uart 使用的串口波特率
//
// 问题3：电压数值不对
//      测测实际电池电压看看 测测对应 B1 引脚对应电压
//      有误差是正常的 可以自行调整 只要对应关系正确即可

